---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamBehavior
source: html/169c6f73-812f-b2d3-3643-5e576707180e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamBehavior Property

"Behavior"

## Syntax (C#)
```csharp
public static ForgeTypeId PhyMaterialParamBehavior { get; }
```